{
  "translation": {
    "header": "Pedro Pizzi",
    "select_language": "Selecciona el idioma:",
    "projects_title": "Proyectos",
    "projects_desc": "Aquí encontrarás mis proyectos académicos, profesionales y personales.",
    "about_title": "Sobre Mí",
    "about_desc": "Perfil: Ingeniero en Computación, Desarrollador Fullstack",
    "about_desc2": "Soy ingeniero en computación con 5 años de experiencia, incluidos 4 años enfocados en el desarrollo full stack. Me apasiona crear soluciones eficientes y seguras utilizando tecnologías modernas y prácticas DevOps.",
    "about_desc3": "Busco mejorar continuamente mis habilidades en arquitectura de software, seguridad y automatización, siempre alineando la tecnología con los objetivos del negocio. Trabajo con enfoque en rendimiento, escalabilidad e innovación, entregando productos que generan un impacto real.",
    "about_desc4": "Hablo cuatro idiomas: portugués, español, inglés y francés. Siempre estoy dispuesto a aprender cosas nuevas.",
    "contact_title": "Contacto",
    "contact_desc": "Puedes encontrarme en GitHub, LinkedIn o enviarme un correo electrónico para colaboraciones o dudas.",
    "footer_text": "Hecho con magia y café ☕",
    "resume_title": "Currículum",
    "resume_desc": "Aquí puedes ver o descargar mi currículum completo en formato PDF.",
    "resume_button": "Ver Currículum",
    "interchange": {
      "title": "Aprobado para un Programa de Intercambio Internacional en España por CEFET-RJ",
      "description": "Desde septiembre de 2025, estudio en la Universidad de Valladolid, mejorando mi español e inglés y relacionándome con una diversa comunidad internacional.",
      "description2": "Esta experiencia está ampliando mi perspectiva, mejorando mi adaptabilidad y comunicación intercultural, y enseñándome a colaborar eficazmente en entornos internacionales."
    },
    "projects": [
      {
        "title": "Monitoreo de Rendimiento",
        "description": "Monitoreo de rendimiento utilizando Grafana, Prometheus y Nest.js",
        "image": "/assets/project-prometheus.jpg",
        "path": "https://github.com/P3dream/performance-monitoring"
      },
      {
        "title": "Detección de ataques DoS con IA generativa",
        "description": "Detección de ataques DoS utilizando IA generativa, proyecto final en Cefet/RJ",
        "image": "/assets/project-dos-image.jpg",
        "path": "https://github.com/P3dream/detect-dos-attacks-with-llama"
      },
      {
        "title": "Back-end con NestJS",
        "description": "Proyecto base de back-end con NestJS, TypeORM y PostgreSQL. Incluye autenticación JWT, servicio de correo electrónico y operaciones con entidades.",
        "image": "/assets/nest-project.jpg",
        "path": "https://github.com/P3dream/nest-back-end-project"
      },
      {
        "title": "Pacman en Assembly P3",
        "description": "Juego de Pacman desarrollado por mí en Assembly P3, en la asignatura de Arquitectura de Computadores del CEFET/RJ, para el curso de Ingeniería Informática.",
        "image": "/assets/pacman-project.jpg",
        "path": "https://github.com/P3dream/PacmanAS"
      },
      {
        "title": "Sistema de Biblioteca con Listas Enlazadas",
        "description": "Sistema para Linux desarrollado en C usando listas enlazadas para gestión eficiente de memoria. Gestiona estudiantes/libros/infraestructura con operaciones de complejidad O(n).",
        "image": "/assets/library-project.jpg",
        "path": "https://github.com/P3dream/Sistema_biblioteca"
      },
      {
        "title": "Productor-Consumidor Paralelo con fork()",
        "description": "Implementación en C exclusiva para Linux que demuestra paralelismo a nivel de procesos usando fork(). Contiene un productor generando datos y un consumidor procesándolos mediante memoria compartida, desarrollado para exploración académica de conceptos básicos de paralelización.",
        "image": "/assets/fork-project.jpg",
        "path": "https://github.com/P3dream/Problema-Produtor-Consumidor-usando-fork"
      },
      {
        "title": "Proyecto de Portafolio Personal",
        "description": "Un portafolio personal que muestra mis habilidades y proyectos usando React, TypeScript, Vite e i18n.",
        "image": "/assets/portfolio.png",
        "path": "https://github.com/P3dream/portifolio"
      }
    ],
    "recomendations": [
      {
        "title": "Dalbert Matos Mascarenhas",
        "description": "Doctor en Computación y Profesor de Ingeniería de Computación en la Facultad Estatal de Tecnología de Río de Janeiro (CEFET/RJ).",
        "image": "assets/dalbert-preview.png",
        "path": "recommendation-letters/recommendation-letter-dalbert-mascarenhas.pdf"
      },
      {
        "title": "Laura Silva de Assis",
        "description": "Doctora en Ingeniería Eléctrica y Profesora de Ingeniería en Computación en la Facultad Estatal de Tecnología de Río de Janeiro (CEFET/RJ).",
        "image": "assets/laura-preview.png",
        "path": "recommendation-letters/recommendation-letter-laura-assis.pdf"
      },
      {
        "title": "Cristiano de Souza de Carvalho",
        "description": "Doctor en Ingeniería Mecánica y Profesor de Ingeniería de Computación en la Facultad Estatal de Tecnología de Río de Janeiro (CEFET/RJ).",
        "image": "/assets/cristiano-preview.png",
        "path": "recommendation-letters/recommendation-letter-cristiano-carvalho.pdf"
      },
      {
        "title": "Pedro Carlos da Silva Lara",
        "description": "Doctor en Modelado Computacional y Profesor de Ingeniería de Computación en la Facultad Estatal de Tecnología de Río de Janeiro (CEFET/RJ).",
        "image": "/assets/pedro-lara-preview.png",
        "path": "recommendation-letters/recommendation-letter-pedro-lara.pdf"
      },
      {
        "title": "Diego Barreto Haddad",
        "description": "Doctor en Ingeniería Eléctrica y Profesor de Ingeniería Informática en la Facultad Estatal de Tecnología de Río de Janeiro (CEFET/RJ).",
        "image": "/assets/diego-preview.png",
        "path": "recommendation-letters/recommendation-letter-diego-barreto-haddad.pdf"
      },
      {
        "title": "Luis Retondaro",
        "description": "Doctor en Ingeniería de Sistemas y Computación y Profesor de Ingeniería de Computación en la Facultad Estatal de Tecnología de Río de Janeiro (CEFET/RJ).",
        "image": "/assets/luis-retondaro-preview.png",
        "path": "recommendation-letters/recommendation-letter-pedro-lara.pdf"
      }
    ],
    "blog_title": "Youtube",
    "blog_desc": "Consulta mis publicaciones comentando videos tutoriales que publico en YouTube.",
    "blog_post_1_title": "Introducción a Nest.js",
    "blog_post_1_desc": "Aprende a configurar un proyecto Nest.js desde cero con buenas prácticas.",
    "blog_post_2_title": "Iniciando Nuestro Proyecto con NestJS | Modelado de Entidades y Explicación de Conceptos Básicos",
    "blog_post_2_desc": "Primeros pasos con NestJS: creación del proyecto, modelado de entidades iniciales y explicación de los fundamentos del framework.",
    "watch_video": "Ver video",
    "recommendations_title": "Cartas de Recomendación",
    "recommendations_desc": "En esta sección comparto algunas cartas de recomendación escritas por profesores del CEFET/RJ que acompañaron de cerca mi formación académica. Estoy muy agradecido por la orientación y el apoyo que me brindaron. Estas cartas forman parte importante de mi camino y están aquí para quienes deseen conocerlo mejor."

  }
}
