{
  "translation": {
    "header": "Pedro Pizzi",
    "select_language": "Selecione o idioma:",
    "projects_title": "Projetos",
    "projects_desc": "Aqui você encontrará meus projetos acadêmicos, profissionais e pessoais.",
    "about_title": "Sobre Mim",
    "about_desc": "Perfil: Engenheiro de Computação, Desenvolvedor Fullstack",
    "about_desc2": "Sou engenheiro de computação com 5 anos de experiência, sendo 4 dedicados ao desenvolvimento full stack. Tenho paixão por criar soluções eficientes e seguras, utilizando tecnologias modernas e práticas DevOps.",
    "about_desc3": "Busco constantemente aprimoramento em arquitetura de software, segurança e automação, sempre alinhando tecnologia aos objetivos de negócio. Atuo com foco em performance, escalabilidade e inovação, entregando produtos que geram impacto real.",
    "about_desc4": "Falo quatro idiomas: português, espanhol, inglês e francês. Estou sempre em busca de novos aprendizados.",
    "contact_title": "Contato",
    "contact_desc": "Você pode me encontrar no GitHub, LinkedIn ou me enviar um e-mail para colaborações ou dúvidas.",
    "footer_text": "Feito com magia e café ☕",
    "resume_title": "Currículo",
    "resume_desc": "Aqui você pode visualizar ou baixar meu currículo completo em PDF.",
    "resume_button": "Ver Currículo",
    "interchange": {
      "title": "Aprovado para um Programa de Intercâmbio Internacional na Espanha pelo CEFET-RJ",
      "description": "Desde setembro de 2025, estou estudando na Universidad de Valladolid, aprimorando meu espanhol e inglês e interagindo com uma comunidade internacional diversificada.",
      "description2": "Essa experiência está ampliando minha perspectiva, fortalecendo minha adaptabilidade e comunicação intercultural, e me ensinando a colaborar de forma eficaz em ambientes internacionais."
    },
    "projects": [
      {
        "title": "Detecção de ataques DoS usando IA generativa",
        "description": "Detecção de ataques DoS usando IA generativa, projeto do meu TCC no Cefet/RJ",
        "image": "/assets/project-dos-image.jpg",
        "path": "https://github.com/P3dream/detect-dos-attacks-with-llama"
      },
      {
        "title": "Back-end usando NestJS",
        "description": "Projeto base de back-end utilizando NestJS, TypeORM e PostgreSQL. Autenticação JWT, envio de e-mail e operações com entidades.",
        "image": "/assets/nest-project.jpg",
        "path": "https://github.com/P3dream/nest-back-end-project"
      },
      {
        "title": "Pacman em Assembly P3",
        "description": "Pacman desenvolvido por mim, em Assembly P3, na disciplina de Arquitetura de Computadores no CEFET/RJ, curso de Engenharia de Computação.",
        "image": "/assets/pacman-project.jpg",
        "path": "https://github.com/P3dream/PacmanAS"
      },
      {
        "title": "Sistema de Biblioteca com Listas Encadeadas",
        "description": "Sistema para Linux desenvolvido em C utilizando listas encadeadas para gestão eficiente de memória. Controla alunos/livros/infraestrutura com operações de complexidade O(n).",
        "image": "/assets/library-project.jpg",
        "path": "https://github.com/P3dream/Sistema_biblioteca"
      },
      {
        "title": "Produtor-Consumidor Paralelo com fork()",
        "description": "Implementação em C exclusiva para Linux demonstrando paralelismo em nível de processos usando fork(). Inclui um produtor gerando dados e um consumidor processando-os via memória compartilhada, desenvolvido para exploração acadêmica de conceitos básicos de paralelização.",
        "image": "/assets/fork-project.jpg",
        "path": "https://github.com/P3dream/Problema-Produtor-Consumidor-usando-fork"
      },
      {
        "title": "Projeto de Portfólio Pessoal",
        "description": "Um portfólio pessoal apresentando minhas habilidades e projetos usando React, TypeScript, Vite e i18n.",
        "image": "/assets/portfolio.png",
        "path": "https://github.com/P3dream/portifolio"
      }
    ],
    "recomendations":[
      {
        "title": "Dalbert Matos Mascarenhas",
        "description": "Doutor em Computação e Professor de Engenharia de Computação na Faculdade Estadual de Tecnologia de Rio de Janeiro (CEFET/RJ).",
        "image": "assets/dalbert-preview.png",
        "path": "recommendation-letters/recommendation-letter-dalbert-mascarenhas.pdf"
      },
      {
        "title": "Laura Silva de Assis",
        "description": "Doutora em Engenharia Elétrica e Professor de Engenharia de Computação na Faculdade Estadual de Tecnologia de Rio de Janeiro (CEFET/RJ).",
        "image": "assets/laura-preview.png",
        "path": "recommendation-letters/recommendation-letter-laura-assis.pdf"
      },
      {
        "title": "Cristiano de Souza de Carvalho",
        "description": "Doutor em Engenharia Mecânica e Professor de Engenharia de Computação na Faculdade Estadual de Tecnologia de Rio de Janeiro (CEFET/RJ).",
        "image": "/assets/cristiano-preview.png",
        "path": "recommendation-letters/recommendation-letter-cristiano-carvalho.pdf"
      },
      {
        "title": "Pedro Carlos da Silva Lara",
        "description": "Doutor em Modelagem Computacional e Professor de Engenharia de Computação na Faculdade Estadual de Tecnologia de Rio de Janeiro (CEFET/RJ).",
        "image": "/assets/pedro-lara-preview.png",
        "path": "recommendation-letters/recommendation-letter-pedro-lara.pdf"
      },
      {
        "title": "Diego Barreto Haddad",
        "description": "Doutor em Engenharia Elétrica e Professor de Engenharia de Computação na Faculdade Estadual de Tecnologia de Rio de Janeiro (CEFET/RJ).",
        "image": "/assets/diego-preview.png",
        "path": "recommendation-letters/recommendation-letter-diego-barreto-haddad.pdf"
      },
      {
        "title": "Luis Retondaro",
        "description": "Doutor em Engenharia de Sistemas e Computação e Professor de Engenharia de Computação na Faculdade Estadual de Tecnologia de Rio de Janeiro (CEFET/RJ).",
        "image": "/assets/luis-retondaro-preview.png",
        "path": "recommendation-letters/recommendation-letter-pedro-lara.pdf"
      }
    ],
    "blog_title": "Youtube",
    "blog_desc": "Confira meus posts comentando vídeos tutoriais que publico no YouTube.",
    "blog_post_1_title": "Introdução ao Nest.js",
    "blog_post_1_desc": "Veja como configurar do zero um projeto Nest.js com boas práticas.",
    "blog_post_2_title": "Iniciando Nosso Projeto com NestJS | Modelando Entidades e Explicando Conceitos Básicos",
    "blog_post_2_desc": "Primeiros passos com NestJS: criação do projeto, modelagem das entidades iniciais e explicação dos fundamentos do framework.",
    "watch_video": "Assistir vídeo",
    "recommendations_title": "Cartas de Recomendação",
    "recommendations_desc": "Nesta seção compartilho algumas cartas de recomendação escritas por professores do CEFET/RJ que acompanharam de perto minha trajetória acadêmica. Sou grato pela orientação e apoio que recebi ao longo dos anos. Essas cartas representam parte importante dessa caminhada e estão aqui caso queiram conhecer um pouco mais sobre meu percurso."
  }
}